adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_common.h
#define SDK_ATOMIC_LOCAL_TOGGLE(addr, bits) \
    ((1UL == sizeof(*(addr))) ? _SDK_AtomicLocalToggle1Byte((volatile void *)(addr), (bits)) : \
    ((2UL == sizeof(*(addr))) ? _SDK_AtomicLocalToggle2Byte((volatile void *)(addr), (bits)) : \
    _SDK_AtomicLocalToggle4Byte((volatile void *)(addr), (bits))))

#define SDK_ATOMIC_LOCAL_CLEAR_AND_SET(addr, clearBits, setBits) \
    ((1UL == sizeof(*(addr))) ? _SDK_AtomicLocalClearAndSet1Byte((volatile void *)(addr), (clearBits), (setBits)) : \
    ((2UL == sizeof(*(addr))) ? _SDK_AtomicLocalClearAndSet2Byte((volatile void *)(addr), (clearBits), (setBits)) : \
    _SDK_AtomicLocalClearAndSet4Byte((volatile void *)(addr), (clearBits), (setBits))))
#else

#define SDK_ATOMIC_LOCAL_ADD(addr, val)       \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) += (val);                     \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_SET(addr, bits)      \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) |= (bits);                    \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_CLEAR(addr, bits)    \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) &= ~(bits);                   \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_TOGGLE(addr, bits)   \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) ^= (bits);                    \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_CLEAR_AND_SET(addr, clearBits, setBits) \
    do {                                                         \
        uint32_t s_atomicOldInt;                                 \
        s_atomicOldInt = DisableGlobalIRQ();                     \
        *(addr) = (*(addr) & ~(clearBits)) | (setBits);          \
        EnableGlobalIRQ(s_atomicOldInt);                         \
    } while (0)

#endif
/* @} */

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
void DefaultISR(void);
#endif
/*
 * The fsl_clock.h is included here because it needs MAKE_VERSION/MAKE_STATUS/status_t
 * defined in previous of this file.
 */
#include "fsl_clock.h"

/*
 * Chip level peripheral reset API, for MCUs that implement peripheral reset control external to a peripheral
 */
#if ((defined(FSL_FEATURE_SOC_SYSCON_COUNT) && (FSL_FEATURE_SOC_SYSCON_COUNT > 0)) || \
    (defined(FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT) && (FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT > 0)))
#include "fsl_reset.h"
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C"
{
#endif

/*!
     * @brief Enable specific interrupt.
     *
     * Enable LEVEL1 interrupt. For some devices, there might be multiple interrupt
     * levels. For example, there are NVIC and intmux. Here the interrupts connected
     * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
     * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
     * to NVIC first then routed to core.
     *
     * This function only enables the LEVEL1 interrupts. The number of LEVEL1 interrupts
     * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
     *
     * @param interrupt The IRQ number.
     * @retval kStatus_Success Interrupt enabled successfully
     * @retval kStatus_Fail Failed to enable the interrupt
     */
static inline status_t EnableIRQ(IRQn_Type interrupt) {
    status_t status = kStatus_Success;

    if (NotAvail_IRQn == interrupt) {
        status = kStatus_Fail;
    }

    #if defined(FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) && (FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0)
    else if ((int32_t)interrupt >= (int32_t)FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) {
        status = kStatus_Fail;
    }
    #endif

    else {
        #if defined(__GIC_PRIO_BITS)
        GIC_EnableIRQ(interrupt);
        #else
        NVIC_EnableIRQ(interrupt);
        #endif
    }

    return status;
}

/*!
     * @brief Disable specific interrupt.
     *
     * Disable LEVEL1 interrupt. For some devices, there might be multiple interrupt
     * levels. For example, there are NVIC and intmux. Here the interrupts connected
     * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
     * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
     * to NVIC first then routed to core.
     *
     * This function only disables the LEVEL1 interrupts. The number of LEVEL1 interrupts
     * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
     *
     * @param interrupt The IRQ number.
     * @retval kStatus_Success Interrupt disabled successfully
     * @retval kStatus_Fail Failed to disable the interrupt
     */
static inline status_t DisableIRQ(IRQn_Type interrupt) {
    status_t status = kStatus_Success;

    if (NotAvail_IRQn == interrupt) {
        status = kStatus_Fail;
    }

    #if defined(FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) && (FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0)
    else if ((int32_t)interrupt >= (int32_t)FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) {
        status = kStatus_Fail;
    }
    #endif

    else {
        #if defined(__GIC_PRIO_BITS)
        GIC_DisableIRQ(interrupt);
        #else
        NVIC_DisableIRQ(interrupt);
        #endif
    }

    return status;
}

/*!
     * @brief Disable the global IRQ
     *
     * Disable the global interrupt and return the current primask register. User is required to provided the primask
     * register for the EnableGlobalIRQ().
     *
     * @return Current primask value.
     */
static inline uint32_t DisableGlobalIRQ(void) {
    #if defined(__XCC__)
    return 0;
    #else
    #if defined(CPSR_I_Msk)
    uint32_t cpsr = __get_CPSR() & CPSR_I_Msk;

    __disable_irq();

    return cpsr;
    #else
    uint32_t regPrimask = __get_PRIMASK();

    __disable_irq();

    return regPrimask;
    #endif
    #endif
}

/*!
     * @brief Enable the global IRQ
     *
     * Set the primask register with the provided primask value but not just enable the primask. The idea is for the
     * convenience of integration of RTOS. some RTOS get its own management mechanism of primask. User is required to
     * use the EnableGlobalIRQ() and DisableGlobalIRQ() in pair.
     *
     * @param primask value of primask register to be restored. The primask value is supposed to be provided by the
     * DisableGlobalIRQ().
     */
static inline void EnableGlobalIRQ(uint32_t primask) {
    #if defined(__XCC__)
    #else
    #if defined(CPSR_I_Msk)
    __set_CPSR((__get_CPSR() & ~CPSR_I_Msk) | primask);
    #else
    __set_PRIMASK(primask);
    #endif
    #endif
}

#if defined(ENABLE_RAM_VECTOR_TABLE)
/*!
     * @brief install IRQ handler
     *
     * @param irq IRQ number
     * @param irqHandler IRQ handler address
     * @return The old IRQ handler address
     */
uint32_t InstallIRQHandler(IRQn_Type irq, uint32_t irqHandler);
#endif /* ENABLE_RAM_VECTOR_TABLE. */

#if (defined(FSL_FEATURE_SOC_SYSCON_COUNT) && (FSL_FEATURE_SOC_SYSCON_COUNT > 0))

